In [1]:
import pandas as pd

In [2]:
dict1 = {'Name':['priyang','aadhya','krishna','vedant','parshv','mittal','archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['male','female','female','male','male','female','female']}
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  priyang     98    male
1   aadhya     89  female
2  krishna     99  female
3   vedant     87    male
4   parshv     90    male
5   mittal     83  female
6  archana     99  female

### display 1st 3 rows

In [3]:
df1.head(3)

      Name  Marks  Gender
0  priyang     98    male
1   aadhya     89  female
2  krishna     99  female

### display last 3 rows

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   parshv     90    male
5   mittal     83  female
6  archana     99  female

### find the number of rows and columns

In [5]:
df1.shape

(7, 3)

In [6]:
print('Number of rows:',df1.shape[0])
print('Number of columns:',df1.shape[1])

Number of rows: 7
Number of columns: 3

### display data type of each column and memory requirement

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### find out the null values

In [8]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### display statistical data

In [9]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

### find unique values from gender

In [10]:
df1['Gender'].unique()

array(['male', 'female'], dtype=object)

### display the count of unique values from gender

In [11]:
df1['Gender'].nunique()

2

### display the total count of each unique value from gender

In [12]:
df1['Gender'].value_counts()

female    4
male      3
Name: Gender, dtype: int64

### find the total number of students having marks between 90 to 100

In [14]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  priyang     98    male
2  krishna     99  female
4   parshv     90    male
6  archana     99  female

In [15]:
len(df1[df1['Marks']>=90])

4

In [17]:
# using between operator
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  priyang     98    male
2  krishna     99  female
4   parshv     90    male
6  archana     99  female

In [18]:
sum(df1['Marks'].between(90,100))

4

### find the average marks

In [19]:
df1['Marks'].mean()

92.14285714285714

### find the min and max marks

In [21]:
print(df1['Marks'].min())
print(df1['Marks'].max())

83
99

### apply method

#### divide all the marks by 2 and create a new column as half_marks

In [28]:
def marks(x):
    return x//2

In [29]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [30]:
df1['half_marks'] = df1['Marks'].apply(marks)

In [31]:
df1

      Name  Marks  Gender  half_marks
0  priyang     98    male          49
1   aadhya     89  female          44
2  krishna     99  female          49
3   vedant     87    male          43
4   parshv     90    male          45
5   mittal     83  female          41
6  archana     99  female          49

#### using lambda function

In [32]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

### find the length of each string in name column

In [33]:
df1['Name'].apply(len)

0    7
1    6
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### Map function

In [34]:
df1

      Name  Marks  Gender  half_marks
0  priyang     98    male          49
1   aadhya     89  female          44
2  krishna     99  female          49
3   vedant     87    male          43
4   parshv     90    male          45
5   mittal     83  female          41
6  archana     99  female          49

#### replace male with 1 and female with 0

In [39]:
df1['male_female'] = df1['Gender'].map({'male':1,'female':0})

In [40]:
df1

      Name  Marks  Gender  half_marks  male_female
0  priyang     98    male          49            1
1   aadhya     89  female          44            0
2  krishna     99  female          49            0
3   vedant     87    male          43            1
4   parshv     90    male          45            1
5   mittal     83  female          41            0
6  archana     99  female          49            0

### drop function

#### drop last 2 columns

In [42]:
df1.drop(['half_marks','male_female'],axis=1,inplace=True)

In [43]:
df1

      Name  Marks  Gender
0  priyang     98    male
1   aadhya     89  female
2  krishna     99  female
3   vedant     87    male
4   parshv     90    male
5   mittal     83  female
6  archana     99  female

### display the column names

In [44]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

### sort the dataframe using marks

In [45]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   mittal     83  female
3   vedant     87    male
1   aadhya     89  female
4   parshv     90    male
0  priyang     98    male
2  krishna     99  female
6  archana     99  female

In [46]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2  krishna     99  female
6  archana     99  female
0  priyang     98    male
4   parshv     90    male
1   aadhya     89  female
3   vedant     87    male
5   mittal     83  female

### display name and marks of female students

In [48]:
df1[df1['Gender']=='female']

      Name  Marks  Gender
1   aadhya     89  female
2  krishna     99  female
5   mittal     83  female
6  archana     99  female

In [54]:
df1[df1['Gender'].isin(['female'])][['Name','Marks']]

      Name  Marks
1   aadhya     89
2  krishna     99
5   mittal     83
6  archana     99

### display only name of female students

In [50]:
df1[df1['Gender']=='female']['Name']

1     aadhya
2    krishna
5     mittal
6    archana
Name: Name, dtype: object